Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsEdgeHandle
Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetEdgeNumber
If the RebarConstrainedHandle's RebarHandleType is 'Edge,'
then this function will return the number of the edge that is
driven by the handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
The RebarConstrainedHandle is not of RebarHandleType 'Edge.'
Since:
2014